[
    {"id":"1", "link": "/podcasts/1", "views":"11k", "category": "vocatioReimagined", "title": "Episode 1 : Creating Space in a Distracted World", "creator": "Dr. Christopher Cobbler", "thumbnail": "/podcast creating space in a distracted world.jpg", "url": "https://acu-cdn-pull.b-cdn.net/Episode%201%20Creating%20Space%20in%20a%20Distractred%20World.m4v", "description" : "Our attention is up for grabs. Our culture has unapologetically embraced a way of being in the world that is encumbered by various forms of distraction. Emails, text messages, work that needs to get done now, a never-ending, ever growing to-do list, a new series to binge watch on Netflix. Our environments are highly engineered for ceaseless mental stimulation that often subverts our deeply held values. God is inviting us to participate in something meaningful and beauty is emerging all around us. That will never change. The unfortunate truth is we're often too distracted to notice."},
    {"id":"2", "link": "/podcasts/2",  "views": "1.2", "category": "vocatioReimagined","title": "Episode 2 : Reimagining Hospitality", "creator": "Dr. Christopher Cobbler", "thumbnail": "/podcast radical hospitality.jpg", "url": "https://acu-cdn-pull.b-cdn.net/Episode%202%20Radical%20Hospitality.m4v", "description" : "Hospitality is a vital posture when it comes to vocational formation. But when we think of the word hospitality, we often think of being the host instead of the guest. With good intentions we often invite people into our realities, extending kindness, goodwill, and pleasantry but on our terms within the lived assumptions of our view of the world. Hospitality, though, could also be understood as assuming the posture of guest. It is about creating space for others to appear on their own terms and opening our heart to what we might learn from those who see things differently. Reclaiming this view of hospitality helps us to see God as the host who is inviting us to participate in something beautiful. We don't have to show up with the answers, or correct language, we can simply show up as the guest accepting a gracious invitation."},
    {"id":"3", "link": "/podcasts/3", "views": "2.2", "category": "vocatioReimagined","title": "Episode 3 : The spiritual Art of Slowing Down", "creator": "Dr. Christopher Cobbler", "thumbnail": "/podcast the spiritual art of slowing down.jpg", "url": "https://acu-cdn-pull.b-cdn.net/Episode%203%20The%20Spiritual%20Art%20of%20Slowing%20Down.m4v", "description" : "It's no secret, we live in a fast-paced world. Whether we are waiting for dinner, preparing for a project, or sitting at a stop light; these moments are far too often accompanied by the dreaded question, \"how long?\" Many of us live with the assumption that faster is always better. Any notion of a slowness, especially in the Western world, is often viewed pejoratively. God's work in the world is often slow and intentional; progressive but not rushed or pressured. Psalm 46:10 invites us to \"Be still.\" Slowing down welcomes the possibility of discovery, it is often the necessary prerequisite for seeing where God is at work. This posture may feel at odds with the way you are invited to show up in your context, but I would like to invite you to consider an alternative way."},
    {"id":"4", "link": "/podcasts/4", "views": "1.1", "category": "vocatioReimagined","title": "Episode 4 : When Your Calling and Career Don't Align", "creator": "Dr. Christopher Cobbler", "thumbnail": "/podcast when your calling and career do not align.jpg", "url": "https://acu-cdn-pull.b-cdn.net/Episode%204%20When%20Your%20Calling%20and%20Career%20Do%20Not%20Align.m4v", "description" : "Sometimes we enter a season of life where our sense of calling aligns with our career or occupation. In these seasons we may engage our employment with a deep sense of gratitude and fulfilment. But there are others who have occupations that do not align with their passions or desires at all. There are some who work, not for pleasure, but to simply keep food on their table, clothes on their back and a roof over their head. For them, the ability to simply choose a career is a luxury they cannot afford. How do we wrestle faithfully with our vocation when our sense of calling is at odds with our present reality?"} 
]
